Reports/ПрайсЛистДляРассылки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Report>
		<Properties>
			<Name>ПрайсЛистДляРассылки</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИмяФайлаПрайсЛиста</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Catalogs/НастройкиПрайсЛиста.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>НастройкиПрайсЛиста</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СтраницаПрайсЛиста</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраницыПрайсЛиста</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Настройки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Reports/ПрайсЛистДляРассылки/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Функция ФоновоеЗаданиеЗапустить()
	
	ТабличныйДокумент.Очистить();
	
	//Если Отчет.Дата = Дата(1,1,1) Тогда
	//	Отчет.Дата = ТекущаяДатаСеанса();
	//КонецЕсли;
	//
	//СписокВидовЦен = Новый СписокЗначений;	
	//ВыбратьВидыЦенРекурсивно(ДеревоВидовЦен.ПолучитьЭлементы(), СписокВидовЦен);
	
	// Запуск фонового задания
	
	//ТекОбъект = РеквизитФормыВЗначение("Отчет");
	//СКДНоменклатура = ТекОбъект.ПолучитьМакет("СКДНоменклатура");
	//СКДФактура 		= ТекОбъект.ПолучитьМакет("СКДФактура");
	//СписокДляОтбораНоменклатуры = ПолучитьМассивСсылокПоОтбору(СКДНоменклатура, КомпоновщикНастроекНоменклатура, "Номенклатура");
	//СписокДляОтбораФактур 		= ПолучитьМассивСсылокПоОтбору(СКДФактура, КомпоновщикНастроекФактура, "Фактура");
	
	//СтруктураПараметров = Новый Структура;
	//СтруктураПараметров.Вставить("ТаблицаПоказателей", ТаблицаТекущихПоказателей.Выгрузить());
	//СтруктураПараметров.Вставить("Период", Период);	
	
	ПараметрыФормированияОтчета = Новый Структура;
	//
	//ПараметрыФормированияОтчета.Вставить("Организация", Отчет.Организация);
	//ПараметрыФормированияОтчета.Вставить("Дата", Отчет.Дата);
	//ПараметрыФормированияОтчета.Вставить("Валюта", Отчет.Валюта);
	//
	//ПараметрыФормированияОтчета.Вставить("ПрайсТоварыМатериалыУслуги", Отчет.ПрайсТоварыМатериалыУслуги);	
	//ПараметрыФормированияОтчета.Вставить("ПрайсПотолки", Отчет.ПрайсПотолки);
	//ПараметрыФормированияОтчета.Вставить("ПрайсПроизводственныеУслугиНаПотолки", Отчет.ПрайсПроизводственныеУслугиНаПотолки);
	//ПараметрыФормированияОтчета.Вставить("ПрайсОтрезы", Отчет.ПрайсОтрезы);
	//ПараметрыФормированияОтчета.Вставить("ПрайсПроизводственныеУслугиНаОтрезы", Отчет.ПрайсПроизводственныеУслугиНаОтрезы);
	//
	//ПараметрыФормированияОтчета.Вставить("ПоказыватьНулевыеЦены", 		Отчет.ПоказыватьНулевыеЦены);
	//ПараметрыФормированияОтчета.Вставить("ПоказыватьАрхивныеПозиции", 	Отчет.ПоказыватьАрхивныеПозиции);
	//ПараметрыФормированияОтчета.Вставить("Потолки_ПоказыватьНулевыеЦены", 		Отчет.Потолки_ПоказыватьНулевыеЦены);
	//ПараметрыФормированияОтчета.Вставить("Потолки_ПоказыватьАрхивныеПозиции", 		Отчет.Потолки_ПоказыватьАрхивныеПозиции);
	//ПараметрыФормированияОтчета.Вставить("ПроизводственныеУслуги_ПоказыватьАрхивныеПозиции", 		Отчет.ПроизводственныеУслуги_ПоказыватьАрхивныеПозиции);
	//ПараметрыФормированияОтчета.Вставить("ПроизводственныеУслугиОтрезы_ПоказыватьАрхивныеПозиции", 	Отчет.ПроизводственныеУслугиОтрезы_ПоказыватьАрхивныеПозиции);
	//ПараметрыФормированияОтчета.Вставить("Отрезы_ПоказыватьНулевыеЦены", 		Отчет.Отрезы_ПоказыватьНулевыеЦены);
	//ПараметрыФормированияОтчета.Вставить("Отрезы_ПоказыватьАрхивныеПозиции", 	Отчет.Отрезы_ПоказыватьАрхивныеПозиции);
	//
	//ПараметрыФормированияОтчета.Вставить("СписокДляОтбораНоменклатуры",	СписокДляОтбораНоменклатуры);
	//ПараметрыФормированияОтчета.Вставить("СписокДляОтбораФактур", 		СписокДляОтбораФактур);
	//
	//ПараметрыФормированияОтчета.Вставить("Потолки_ГруппировкаПоФактуре", 		Отчет.Потолки_ГруппировкаПоФактуре);
	//ПараметрыФормированияОтчета.Вставить("Потолки_ГруппировкаПоГруппеФактур", 	Отчет.Потолки_ГруппировкаПоГруппеФактур);
	//ПараметрыФормированияОтчета.Вставить("Отрезы_ГруппировкаПоФактуре", 		Отчет.Отрезы_ГруппировкаПоФактуре);
	//ПараметрыФормированияОтчета.Вставить("Отрезы_ГруппировкаПоГруппеФактур", 	Отчет.Отрезы_ГруппировкаПоГруппеФактур);
	//	
	//ПараметрыФормированияОтчета.Вставить("ВыводитьКартинки", 			Отчет.ВыводитьКартинки);
	//ПараметрыФормированияОтчета.Вставить("СписокВидовЦен", 				СписокВидовЦен);
	//ПараметрыФормированияОтчета.Вставить("ВидыИндивидуальныхЦен", 		Отчет.ВидыИндивидуальныхЦен.Выгрузить());
		
	ПараметрыЗадания = Новый Структура;
	ПараметрыЗадания.Вставить("ИмяМетода", "СформироватьОтчет");
	ПараметрыЗадания.Вставить("ИмяОтчета", "ПрайсЛистДляРассылки");
	//ПараметрыФормированияОтчета.Вставить("КлючВарианта", КлючТекущегоВарианта);
	ПараметрыЗадания.Вставить("ЭтоВнешнийОтчет", Ложь);
	ПараметрыЗадания.Вставить("ПараметрыВыполнения", ПараметрыФормированияОтчета);
	
	ИнформацияОбОшибке = Неопределено;
	Попытка
		ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
		ПараметрыВыполнения.ЗапуститьВФоне = Истина;
		
		ВыполняемыйМетод = "ДлительныеОперации.ВыполнитьПроцедуруМодуляОбъектаОтчета";
		
		РезультатФоновогоЗадания = ДлительныеОперации.ВыполнитьВФоне(
			ВыполняемыйМетод,
			ПараметрыЗадания,
			ПараметрыВыполнения);
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
	КонецПопытки;
	
	Если ИнформацияОбОшибке <> Неопределено Тогда
		ПоказатьОшибкиФормирования(ПоляПредставлениеОшибки(ИнформацияОбОшибке));
		Возврат Неопределено;
	КонецЕсли;
	
	Если РезультатФоновогоЗадания.Статус = "Выполнено" Тогда
		
		ФоновоеЗаданиеЗагрузитьРезультат(РезультатФоновогоЗадания);
		
	ИначеЕсли РезультатФоновогоЗадания.Статус = "Ошибка" Тогда
		
		ПоказатьОшибкиФормирования(РезультатФоновогоЗадания);
		
	ИначеЕсли РезультатФоновогоЗадания.Статус = "Выполняется" Тогда
		
		ОтображениеСостояния = Элементы.ТабличныйДокумент.ОтображениеСостояния;
		ОтображениеСостояния.Видимость                      = Истина;
		ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.Неактуальность;
		ОтображениеСостояния.Картинка                       = БиблиотекаКартинок.ДлительнаяОперация48;
		ОтображениеСостояния.Текст                          = НСтр("ru = 'Отчет формируется...'");
		
	КонецЕсли;
	
	Возврат РезультатФоновогоЗадания;
	
КонецФункции

////////////
&НаСервере
Процедура СформироватьОтчетНаСервере(ПараметрыФормирования, АдресДляРазмещенияРезультата = Неопределено)  
	
	ИмяФайлаРезультат = ПолучитьИмяФайлаДляОтчетаНаСервере("Прайс-Лист " + Формат(ТекущаяДата(), "ДЛФ=DD"));
	
	//1.Страница ПОЛОТНА
	
    ТДРезультатПолотна = ПолучитьТабличныйДокументРезультатОтчетПолотна();
   
    ИмяФайлаПолотна = ПолучитьИмяФайлаДляОтчетаНаСервере("Полотна");
   
    ТДРезультатПолотна.Записать(ИмяФайлаПолотна,ТипФайлаТабличногоДокумента.XLSX);
   

    Эксель = New COMObject("Excel.Application");
				
	Книга = Эксель.WorkBooks.Add(); 
	
	Книга.Sheets(1).Name = "СОДЕРЖАНИЕ";
	
	ЛистСодержание=Книга.Sheets(1);
	
	ЛистСодержание.Tab.ColorIndex = 3;
	
	ДобавитьСраницуВФайлРезультатНаСервере(Эксель, Книга, ИмяФайлаПолотна, "ПОЛОТНА");
	
	Файл = Новый Файл(ИмяФайлаРезультат);   // если существует то заменяем его
	Если Файл.Существует() Тогда
		УдалитьФайлы(ИмяФайлаРезультат);
	КонецЕсли;
		
	Книга.SaveAs(ИмяФайлаРезультат, 51); //xlWorkbookNormal -4143 Workbook normal 
	
	Книга.Close();
	Эксель.Quit();	
КонецПроцедуры

Процедура ДобавитьСраницуВФайлРезультатНаСервере(Эксель, КнигаКудаДобавляемСтраницу, ИмяДобавляемогоФайла, ИмяСтраницы)
	
	Книга = Эксель.Workbooks.Open(ИмяДобавляемогоФайла);
	
	Лист = Книга.Sheets("TDSheet"); // потому что сформированный из mxl-ки лист Excel получает по умолчанию имя "TDSheet"
		
	Лист.Copy(,КнигаКудаДобавляемСтраницу.Worksheets(1)); 
	
	КнигаКудаДобавляемСтраницу.Sheets("TDSheet").Name = "ПОЛОТНА";
		
	Книга.Close(); 
	
	Файл = Новый Файл(ИмяДобавляемогоФайла);
	Если Файл.Существует() Тогда
		УдалитьФайлы(ИмяДобавляемогоФайла);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСраницуВФайлРезультатНаКлиенте(Эксель, КнигаКудаДобавляемСтраницу, ИмяДобавляемогоФайла, ИмяСтраницы, НомерСтраницы)
	
	Книга = Эксель.Workbooks.Open(ИмяДобавляемогоФайла);
	
	Лист = Книга.Sheets("TDSheet"); // потому что сформированный из mxl-ки лист Excel получает по умолчанию имя "TDSheet"
		
	Лист.Copy(,КнигаКудаДобавляемСтраницу.Worksheets(НомерСтраницы)); 
	
	КнигаКудаДобавляемСтраницу.Sheets("TDSheet").Name = ИмяСтраницы;
		
	Книга.Close(); 
	
	Файл = Новый Файл(ИмяДобавляемогоФайла);
	Если Файл.Существует() Тогда
		УдалитьФайлы(ИмяДобавляемогоФайла);
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура СформироватьотчетНаКлиенте(ПараметрыФормирования, АдресДляРазмещенияРезультата = Неопределено)
	
	ИмяФайлаРезультат = ПолучитьИмяФайлаДляОтчетаНаКлиенте("Прайс-Лист " + Формат(ТекущаяДата(), "ДЛФ=DD"));
	
	
	МассивСтраницДляПолученияДанных = ПолучитьМассивСтраниц();
	
	
	ИмяФайла = ПолучитьИмяФайлаДляОтчетаНаКлиенте("Содержание");	
	ТДРезультат = ПолучитьТабличныйДокументСтраницыСодержание();	
	ТДРезультат.Записать(ИмяФайла, ТипФайлаТабличногоДокумента.XLSX);

	
	МассивСтраниц = Новый Массив;
	
	МассивСтраниц.Добавить(Новый Структура("ИмяФайла, ИмяСтраницы", ИмяФайла, "СОДЕРЖАНИЕ"));
	
	Для Каждого СтраницаДляПолученияДанных Из МассивСтраницДляПолученияДанных Цикл
		
		Если ВРег(СтраницаДляПолученияДанных.СтраницаПрайсЛистаИмя) = "ПОЛОТНА" Тогда
			
	        ТДРезультат = ПолучитьТабличныйДокументРезультатОтчетПолотна();
			
		Иначе
			
			ТДРезультат = ПолучитьТабличныйДокументРезультатОтчетСтраницы(СтраницаДляПолученияДанных.СтраницаПрайсЛистаСсылка);
			
		КонецЕсли;
		
		Если ТДРезультат <> Неопределено Тогда
			
			ИмяФайла = ПолучитьИмяФайлаДляОтчетаНаКлиенте(СтраницаДляПолученияДанных.СтраницаПрайсЛистаИмя);
			ТДРезультат.Записать(ИмяФайла,ТипФайлаТабличногоДокумента.XLSX);
			МассивСтраниц.Добавить(Новый Структура("ИмяФайла, ИмяСтраницы", ИмяФайла, СтраницаДляПолученияДанных.ИмяСтраницы));
			
		КонецЕсли;
		
	КонецЦикла;	

    Эксель = New COMObject("Excel.Application");
	Эксель.DisplayAlerts = ЛОЖЬ;			
	
	Книга = Эксель.WorkBooks.Add(); 
	
	А = 1;
	
	Для Каждого СтраницаКВыводу Из МассивСтраниц Цикл
		
    	ДобавитьСраницуВФайлРезультатНаКлиенте(Эксель, Книга, СтраницаКВыводу.ИмяФайла, СтраницаКВыводу.ИмяСтраницы, А);
		
		Эксель.ActiveWindow.DisplayGridlines = ЛОЖЬ;
		Эксель.ActiveWindow.DisplayHeadings = ЛОЖЬ;
		
		А = А + 1;
		
	КонецЦикла;	
	
	ПервыйЛист = Книга.Sheets(1);
	ПервыйЛист.Delete(); 
	
	ЛистСодержание=Книга.Sheets(1);
	
	ЛистСодержание.Tab.ColorIndex = 3; 
	
	Для А = 1 По 7 Цикл 
		
		Если А >= МассивСтраниц.Количество() Тогда
			НайденнаяЯчейка = ЛистСодержание.Cells.Find("@" + А + "страница@",ЛистСодержание.Cells(1,1),-4123,1);
		 	НайденнаяЯчейка.Value = "";
		Иначе	
		 	НайденнаяЯчейка = ЛистСодержание.Cells.Find("@" + А + "страница@",ЛистСодержание.Cells(1,1),-4123,1);
		 	НайденнаяЯчейка.Value = МассивСтраниц[А].ИмяСтраницы;
			ЛистСодержание.Hyperlinks.Add(НайденнаяЯчейка, , "'" + СокрЛП(МассивСтраниц[А].ИмяСтраницы) + "'!R1C");
		КонецЕсли;
		
	КонецЦикла;	
	
	КоличествоЛистов = Эксель.ActiveWorkbook.Worksheets.Count;
    КоллекцияЛистов = Эксель.ActiveWorkbook.Worksheets;
	Для ТекНомерЛиста = 1 По КоличествоЛистов  Цикл
    	ТекЛист = Эксель.ActiveWorkbook.Worksheets(ТекНомерЛиста);

		Попытка 
			НайденнаяЯчейка = ТекЛист.Cells.Find("www.optceiling.ru",ТекЛист.Cells(1,1),-4123,1);
			ТекЛист.Hyperlinks.Add(НайденнаяЯчейка, "http://optceiling.ru", "", "www.optceiling.ru", "www.optceiling.ru");
		Исключение
			
		КонецПопытки;
		
		Попытка  
			НачатьПоискСЯчейки = ТекЛист.Cells(1,1); 
			ПоследняяЯчейка = ТекЛист.Cells(ТекЛист.UsedRange.Rows.Count,ТекЛист.UsedRange.Columns.Count);
			Пока Истина Цикл
				Если НачатьПоискСЯчейки.Row >= ПоследняяЯчейка.Row Тогда
					Прервать;
				КонецЕсли;	
				НайденнаяЯчейка = ТекЛист.Range(НачатьПоискСЯчейки, ПоследняяЯчейка).Find("https://optceiling.ru/", НачатьПоискСЯчейки,-4123,2);
				Если НайденнаяЯчейка = Неопределено Тогда
					Прервать;
				КонецЕсли;
				
				НачатьПоискСЯчейки = ТекЛист.Cells(НайденнаяЯчейка.Row + 1, 1); 
				
				НайденнаяЯчейкаСоСдвигомВлево = ТекЛист.Cells(НайденнаяЯчейка.Row, НайденнаяЯчейка.Column - 1);
				
				К = НайденнаяЯчейка.Column - 2;
				Пока НайденнаяЯчейкаСоСдвигомВлево.Value = Неопределено ИЛИ К >= 1 Цикл 
					НайденнаяЯчейкаСоСдвигомВлево = ТекЛист.Cells(НайденнаяЯчейка.Row, К);
					К = К - 1;
				КонецЦикла;   
				
				Если НайденнаяЯчейкаСоСдвигомВлево = Неопределено ИЛИ НайденнаяЯчейкаСоСдвигомВлево.Value = Неопределено Тогда
					ТекЛист.Hyperlinks.Add(НайденнаяЯчейка, НайденнаяЯчейка.Value, "", НайденнаяЯчейка.Value, НайденнаяЯчейка.Value);
				Иначе	
					ТекЛист.Hyperlinks.Add(НайденнаяЯчейкаСоСдвигомВлево, НайденнаяЯчейка.Value, "", НайденнаяЯчейкаСоСдвигомВлево.Value, НайденнаяЯчейкаСоСдвигомВлево.Value);
				КонецЕсли;	
			КонецЦикла;
		Исключение
			
		КонецПопытки;				
	КонецЦикла; 
		
	Файл = Новый Файл(ИмяФайлаРезультат);   // если существует то заменяем его
	Если Файл.Существует() Тогда
		УдалитьФайлы(ИмяФайлаРезультат);
	КонецЕсли;
		
	Книга.SaveAs(ИмяФайлаРезультат, 51); //xlWorkbookNormal -4143 Workbook normal 
	
	//Книга.Close();
	//Эксель.Quit();
	
	Эксель.Visible = Истина;
	
	//Попытка
	//	ЗапуститьПриложение(ИмяФайлаРезультата);
	//Исключение
	//	
	//КОнецПопытки;
КонецПроцедуры 

Функция ПолучитьМассивСтраниц()
	
	МассивСтраниц = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиПрайсЛиста.СтраницаПрайсЛиста.Ссылка КАК СтраницаПрайсЛистаСсылка,
		|	НастройкиПрайсЛиста.Наименование КАК ИмяСтраницы,
		|	НастройкиПрайсЛиста.Порядок КАК Порядок,
		|	НастройкиПрайсЛиста.СтраницаПрайсЛиста.ИмяПредопределенныхДанных КАК СтраницаПрайсЛистаИмя
		|ИЗ
		|	Справочник.НастройкиПрайсЛиста КАК НастройкиПрайсЛиста
		|ГДЕ
		|	НЕ НастройкиПрайсЛиста.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	Порядок";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		МассивСтраниц.Добавить(Новый Структура("ИмяСтраницы, СтраницаПрайсЛистаСсылка, СтраницаПрайсЛистаИмя", 
		ВыборкаДетальныеЗаписи.ИмяСтраницы, ВыборкаДетальныеЗаписи.СтраницаПрайсЛистаСсылка, ВыборкаДетальныеЗаписи.СтраницаПрайсЛистаИмя));
	КонецЦикла;
	
	Возврат МассивСтраниц;
	
КонецФункции	

Функция ПолучитьПредопределеннуюСтраницуПрайсЛиста(ИмяЭлемента)
	
	Возврат Справочники.СтраницыПрайсЛиста[ИмяЭлемента];
	
КонецФункции

Функция ПолучитьИмяСтраницыПрайсЛиста(СтраницаПрайсЛиста)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиПрайсЛиста.Наименование КАК НаименованиеСтраницы
		|ИЗ
		|	Справочник.НастройкиПрайсЛиста КАК НастройкиПрайсЛиста
		|ГДЕ
		|	НастройкиПрайсЛиста.СтраницаПрайсЛиста = &СтраницаПрайсЛиста";
	
	Запрос.Параметры.Вставить("СтраницаПрайсЛиста", СтраницаПрайсЛиста);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.НаименованиеСтраницы;
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

Функция ПолучитьТабличныйДокументСтраницыСодержание()
	
	ПрайсЛистДляРассылки = Отчеты["ПрайсЛистДляРассылки"].Создать();
	
	МакетСодержание =  ПрайсЛистДляРассылки.ПолучитьМакет("СОДЕРЖАНИЕ");
		
	Возврат МакетСодержание;
	
КонецФункции

Функция ПолучитьТабличныйДокументРезультатОтчетПолотна()
	
	ПрайсЛистПолотна = Отчеты["ПрайсЛистПолотна"].Создать();
	//СхемаКомпоновкиДанных = ПрайсЛистПолотна.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	//
	//// получаем сохранённые настройки, если они есть
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	НастройкиПрайсЛиста.Ссылка КАК Ссылка
	//	|ИЗ
	//	|	Справочник.НастройкиПрайсЛиста КАК НастройкиПрайсЛиста
	//	|ГДЕ
	//	|	НастройкиПрайсЛиста.СтраницаПрайсЛиста = ЗНАЧЕНИЕ(Справочник.СтраницыПрайсЛиста.Полотна)";
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//
	//Если ВыборкаДетальныеЗаписи.Следующий() Тогда
	//	Настройки = ВыборкаДетальныеЗаписи.Ссылка.Настройки.Получить();
	//Иначе
	//	Возврат Неопределено;	
	//КонецЕсли;
	//
	//Если ТипЗнч(Настройки) <> Тип("НастройкиКомпоновкиДанных") Тогда
	//	//Из схемы возьмем настройки по умолчанию
	//	Настройки = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
	//КонецЕсли;
	//
	////Если ЗначениеЗаполнено(ИмяВарианта)  Тогда
	////	Настройки=СхемаКомпоновкиДанных.ВариантыНастроек[ИмяВарианта].Настройки;
	////КонецЕсли;  

	//ПараметрПериод = Настройки.ПараметрыДанных.Элементы.Найти("Период");
	//ПараметрПериод.Значение = ТекущаяДата();
	//ПараметрПериод.Использование = Истина;
	//
	////Результат = Новый ТабличныйДокумент;
	////ПрайсЛистПолотна.СформироватьОтчет(Результат);

	////Помещаем в переменную данные о расшифровке данных
	//ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;

	////Формируем макет, с помощью компоновщика макета
	//КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;

	////Передаем в макет компоновки схему, настройки и данные расшифровки
	//МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных,
	//                                    Настройки, ДанныеРасшифровки);

	////Выполним компоновку с помощью процессора компоновки
	//ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	//ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки,,
	//                                               ДанныеРасшифровки, Истина);

	////Очищаем поле табличного документа
	//Результат = Новый ТабличныйДокумент;

	////Выводим результат в табличный документ
	//ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	//ПроцессорВывода.УстановитьДокумент(Результат);

	//ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	Возврат ПрайсЛистПолотна.СформироватьОтчет();
	
КонецФункции	

Функция ПолучитьТабличныйДокументРезультатОтчетСтраницы(СтраницаПрайсЛиста)
	
	ПрайсЛистПолотна = Отчеты["ПрайсЛистНоменклатура"].Создать();
	СхемаКомпоновкиДанных = ПрайсЛистПолотна.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	
	// получаем сохранённые настройки, если они есть
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиПрайсЛиста.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.НастройкиПрайсЛиста КАК НастройкиПрайсЛиста
		|ГДЕ
		|	НастройкиПрайсЛиста.СтраницаПрайсЛиста = &СтраницаПрайсЛиста";
	
	Запрос.Параметры.Вставить("СтраницаПрайсЛиста", СтраницаПрайсЛиста);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Настройки = ВыборкаДетальныеЗаписи.Ссылка.Настройки.Получить();
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	Если ТипЗнч(Настройки) <> Тип("НастройкиКомпоновкиДанных") Тогда
		//Из схемы возьмем настройки по умолчанию
		Настройки = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
	КонецЕсли;
	
	//Если ЗначениеЗаполнено(ИмяВарианта)  Тогда
	//	Настройки=СхемаКомпоновкиДанных.ВариантыНастроек[ИмяВарианта].Настройки;
	//КонецЕсли;  

	ПараметрПериод = Настройки.ПараметрыДанных.Элементы.Найти("Период");
	ПараметрПериод.Значение = ТекущаяДата();
	ПараметрПериод.Использование = Истина;

	//Помещаем в переменную данные о расшифровке данных
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;

	//Формируем макет, с помощью компоновщика макета
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;

	//Передаем в макет компоновки схему, настройки и данные расшифровки
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных,
                                        Настройки, ДанныеРасшифровки);

	//Выполним компоновку с помощью процессора компоновки
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки,,
                                                   ДанныеРасшифровки, Истина);

	//Очищаем поле табличного документа
	Результат = Новый ТабличныйДокумент;

	//Выводим результат в табличный документ
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(Результат);

	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьИмяФайлаДляОтчетаНаСервере(ИмяФайла)
	
	Каталог = КаталогВременныхФайлов(); 
	
	ПолныйПутьКФайлу = Каталог + ИмяФайла + ".xlsx";
	
	Возврат ПолныйПутьКФайлу;
	
КонецФункции

&НаКлиенте
Функция ПолучитьИмяФайлаДляОтчетаНаКлиенте(ИмяФайла)
	
	Каталог = КаталогЗагрузки(); 
	
	ПолныйПутьКФайлу = Каталог + ИмяФайла + ".xlsx";
	
	Возврат ПолныйПутьКФайлу;
	
КонецФункции


/////////// 

Функция ДобавитьЛистПоИмени(Excel, ИмяЛиста)

	НомерПоследнегоЛиста = Excel.WorkSheets.Count;
    ДобавленныйЛист = Excel.WorkSheets.Add(,Excel.WorkSheets(НомерПоследнегоЛиста));
    ДобавленныйЛист.Name = ИмяЛиста;
      
    Возврат ДобавленныйЛист; //добавленный новый лист с нужным именем
           
КонецФункции

//Возвращает что-то типо: C:\Users\v.nikiforov\Downloads\
&НаКлиенте
Функция КаталогЗагрузки()
	
	хКаталогДокументы = КаталогДокументов(); // C:\Users\xx\Documents
	
	Если СтрНайти(хКаталогДокументы,"Documents")>0 Тогда
		хКаталогЗагрузки=СтрЗаменить(хКаталогДокументы,"Documents","Downloads"); // ---> C:\Users\xx\Downloads
		хФайл = Новый Файл(хКаталогЗагрузки);
		Если хФайл.Существует() и хФайл.ЭтоКаталог() Тогда
			Возврат хКаталогЗагрузки;
		Иначе
			Возврат "";
		КонецЕсли;
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура СформироватьОтчет(Команда)
	
	//ЗаголовокВыведен = Ложь;
	//
	//РезультатФоновогоЗадания = ФоновоеЗаданиеЗапустить();
	//Если РезультатФоновогоЗадания = Неопределено Тогда 
	//	Возврат;
	//КонецЕсли;
	//Если РезультатФоновогоЗадания.Статус = "Ошибка" Тогда
	//	ПоказатьОшибкиФормирования(РезультатФоновогоЗадания);
	//ИначеЕсли РезультатФоновогоЗадания.Статус <> "Выполняется" Тогда 
	//	//ОперацииПослеФормирования();
	//Иначе
	//	Обработчик = Новый ОписаниеОповещения("ФоновоеЗаданиеВыполнено", ЭтотОбъект, Истина);
	//	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	//	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	//	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатФоновогоЗадания, Обработчик, ПараметрыОжидания);
	//КонецЕсли;
	
	ПараметрыФормированияОтчета = Новый Структура;
	//СформироватьОтчетНаСервере(ПараметрыФормированияОтчета); 
	СформироватьОтчетНаКлиенте(ПараметрыФормированияОтчета);

КонецПроцедуры

&НаКлиенте
Процедура ФоновоеЗаданиеВыполнено(Результат, ЗагрузитьРезультатФормированияОтчета) Экспорт
	
	Если Результат = Неопределено Тогда 
		Возврат;
	КонецЕсли;
		
	Если Результат.Статус = "Выполнено" Тогда 
		ФоновоеЗаданиеЗагрузитьРезультат(Результат);
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		ПоказатьОшибкиФормирования(Результат);
	КонецЕсли;
	
	//ОперацииПослеФормирования();
	
КонецПроцедуры  

&НаСервере
Процедура ФоновоеЗаданиеЗагрузитьРезультат(Знач РезультатФоновогоЗадания)
	
	Если НЕ ЭтоАдресВременногоХранилища(РезультатФоновогоЗадания.АдресРезультата) Тогда
		Возврат;
	КонецЕсли; 
	
	РезультатФормирования = ПолучитьИзВременногоХранилища(РезультатФоновогоЗадания.АдресРезультата);
	
	//НастройкиПечатиСохранить();
	ТабличныйДокумент = РезультатФормирования.ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	//НастройкиПечатиВосстановить();
	
	//ТаблицаДанных.Загрузить(РезультатФормирования.ТаблицаДанных); //для расшифровки
		
	ОтображениеСостояния = Элементы.ТабличныйДокумент.ОтображениеСостояния;
	ОтображениеСостояния.Видимость                      = Ложь;
	ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.НеИспользовать;
	ОтображениеСостояния.Картинка                       = Новый Картинка;
	ОтображениеСостояния.Текст                          = "";
	
	УдалитьИзВременногоХранилища(РезультатФоновогоЗадания.АдресРезультата);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПоляПредставлениеОшибки(Знач ИнформацияОбОшибке)
	
	Результат = Новый Структура;
	КраткоеПредставлениеОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
	ПодробноеПредставлениеОшибки = НСтр("ru = 'Ошибка при формировании:'") + Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
	Если ПустаяСтрока(КраткоеПредставлениеОшибки) Тогда
		КраткоеПредставлениеОшибки = ПодробноеПредставлениеОшибки;
	КонецЕсли;
	Результат.Вставить("КраткоеПредставлениеОшибки", КраткоеПредставлениеОшибки);
	Результат.Вставить("ПодробноеПредставлениеОшибки", ПодробноеПредставлениеОшибки);
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ПоказатьОшибкиФормирования(Знач ДанныеОшибки)
	
	Если ТипЗнч(ДанныеОшибки) = Тип("Структура") Тогда
		КраткоеПредставлениеОшибки = ДанныеОшибки.КраткоеПредставлениеОшибки;
		ПодробноеПредставлениеОшибки = ДанныеОшибки.ПодробноеПредставлениеОшибки;
	Иначе
		КраткоеПредставлениеОшибки = ДанныеОшибки;
		ПодробноеПредставлениеОшибки = "";
	КонецЕсли;
	
	ОтображениеСостояния = Элементы.ТабличныйДокумент.ОтображениеСостояния;
	ОтображениеСостояния.Видимость                      = Истина;
	ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.Неактуальность;
	ОтображениеСостояния.Картинка                       = Новый Картинка;
	ОтображениеСостояния.Текст                          = КраткоеПредставлениеОшибки;
	
	Если ПустаяСтрока(ПодробноеПредставлениеОшибки) Тогда
		Возврат;
	КонецЕсли; 
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Отчет.ИмяФайлаПрайсЛиста = КаталогЗагрузки();
КонецПроцедуры
